# Python for Financial Analysis and Algorithmic Trading

# 03 -  General Pandas Overview

In [1]:
# Panel-Data :: Pan-Da by Wes McKinney https://github.com/wesm
# DataFrame object
# includes tools for reading writing files in various formats
# interacts with matplotlib 
# important for financial time series and visualizations

### Series

In [2]:
# series are similar to NumPy arrays, 
# except that we can give them a named or datetime index,
# instead of just a numerical index.

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a' , 'b' , 'c']
my_list = [10,  20, 30]
arr = np.array([10,  20, 30])
d = {'a':10 , 'b':20 , 'c':100}

In [5]:
# create a series from a list; by passing the list to pd.Series
# pd.Series(my_list) # notice index 1, 2, 3 auto increment
pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d) # you can also pass a dictionary to a Series

a     10
b     20
c    100
dtype: int64

In [8]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [9]:
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [10]:
ser1 = pd.Series([1,2,3,4], index=['USA','CHINA','FRANCE','GERMANY'])
ser1

USA        1
CHINA      2
FRANCE     3
GERMANY    4
dtype: int64

In [11]:
ser2 =  pd.Series([1,2,3,4], index=['USA','CHINA','ITALY','JAPAN'])
ser2

USA      1
CHINA    2
ITALY    3
JAPAN    4
dtype: int64

In [12]:
ser1['USA']
ser2['JAPAN']
#ser2['CANADA'] # will produce KeyError, as there is no CANADA

4

In [13]:
ser1 + ser2

CHINA      4.0
FRANCE     NaN
GERMANY    NaN
ITALY      NaN
JAPAN      NaN
USA        2.0
dtype: float64

### Pandas - DataFrames

In [14]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,4), index=['A', 'B', 'C', 'D', 'E'], 
                  columns=['col1', 'col2', 'col3', 'col4'])
df

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df['col1']
# type(df['col1'])
# type(df)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: col1, dtype: float64

In [17]:
df[['col1', 'col2']] # pass list of column names for selecting

       col1      col2
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [18]:
# df['new']  # -- will generate error

df['newCol'] = df['col1'] + df['col2'] #  can do arithmetic operations
df

       col1      col2      col3      col4    newCol
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [19]:
df.drop('newCol', axis =1,  inplace=True)
# inplace =True -- to specify for real change in data
df

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df.drop('E', axis = 0 ) # notice row E dropped.

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [21]:
df.shape

(5, 4)

In [22]:
df.loc['E'] # location by label

col1    0.190794
col2    1.978757
col3    2.605967
col4    0.683509
Name: E, dtype: float64

In [23]:
df.iloc[2] # iloc integer index location

col1   -2.018168
col2    0.740122
col3    0.528813
col4   -0.589001
Name: C, dtype: float64

In [24]:
df.loc['A', 'col1']

2.706849839399938

In [25]:
df.loc[['A', 'B'], ['col1', 'col2']]

       col1      col2
A  2.706850  0.628133
B  0.651118 -0.319318

In [26]:
# Conditional Selection in Pandas DF
# using bracket notation just like numpy

booldf = df > 0
booldf # true false matrix

    col1   col2   col3   col4
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [27]:
df[booldf]
# df[df>0] #  same as above -as a shorthand

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df['col1'] > 0 # row C is False - cannot satisfy condition

A     True
B     True
C    False
D     True
E     True
Name: col1, dtype: bool

In [29]:
df[df['col1'] > 0 ]  # omitted null values

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df[df['col4'] < 0 ]['col1']

C   -2.018168
Name: col1, dtype: float64

In [31]:
resultdf = df[df['col1'] > 0 ]
resultdf

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
# multiple conditions application
df[(df['col1']> 0) & (df['col2'] < 0)]  # use & instead of 'and'

       col1      col2      col3      col4
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
# multiple conditions application
df[(df['col1']> 0) > (df['col2'] < 0)]  # use | instead of 'or'

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [34]:
# Resetting index or changing
df

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.reset_index() # inplace =True for permanent change

  index      col1      col2      col3      col4
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [36]:
newindex = 'CA NY WY OR CO'.split()
newindex

['CA', 'NY', 'WY', 'OR', 'CO']

In [37]:
df['States']=newindex
df

       col1      col2      col3      col4 States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [38]:
df.set_index('States')  # Set the DataFrame index using existing columns.

            col1      col2      col3      col4
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [39]:
df # not used inplace =True

       col1      col2      col3      col4 States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

### Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [40]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [41]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [42]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [43]:
df.index.names  # Pandas index name object type

FrozenList([None, None])

In [44]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [45]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [46]:
# Cross section xs Return cross-section from the Series/DataFrame.

# This method takes a `key` argument to select data at a particular level of a MultiIndex.
df.xs('G1')
df.xs(1, level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### Missing Data

In [47]:
# create a df from dict
d  = {'A': [1, 2, np.nan] ,  'B':[5, np.nan, np.nan] , 'C':[1, 2, 3] }
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [48]:
df.dropna() # drop any rows including na values

     A    B  C
0  1.0  5.0  1

In [49]:
df.dropna(axis = 1) # drop any rows including na values, by cols

   C
0  1
1  2
2  3

In [50]:
# thresh : int, optional --  Require that many non-NA values.
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [51]:
df['A'].fillna(value =df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Group by

In [52]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [53]:
by_Company = df.groupby('Company')
#by_Company.mean()
# by_Company.std()
by_Company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [54]:
by_Company.sum().loc['FB']
# df.groupby('Company').sum().loc['FB'] same

Sales    593
Name: FB, dtype: int64

In [55]:
#df.groupby('Company').describe()
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### Merge , Join, and Concatenate

In [56]:
import pandas as pd

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 


df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [57]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [58]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [59]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [60]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [61]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [62]:
pd.merge(left, right, how='inner', on='key') # inner join is default

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [63]:
# Joining  is a convenient method for combining 
# the columns of two potentially differently indexed DataFrames
# into a single result DataFrame

left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

left.join(right) # default join method how='left'

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [64]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [65]:
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

###  Operations

In [66]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [67]:
# finding unique values in a df
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [68]:
# len(df['col2'].unique())
df['col2'].nunique() # nunique: number of unique values in col2

3

In [69]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [70]:
df[df['col1']> 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [71]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [72]:
# apply function to a df

def times2(x):
    return x*2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [73]:
df['col2'].apply(lambda x: 2*x)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [74]:
# df.drop('col1', axis=1)

In [75]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [76]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [77]:
df.sort_values(by='col2') # sorting

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [78]:
df.isnull() # check if there is null values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [79]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [80]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [81]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C']).dropna()

C          x    y
A   B
bar one  4.0  1.0
foo one  1.0  3.0

### clean up the kernel

In [ ]:
# Let's clean up the kernel, and make a fresh restart to speed up the notebook.
# this will restart kernel and free up some memory. 
from IPython.core.display import HTML
HTML("<script>Jupyter.notebook.kernel.restart()</script>")

### Data Input and Output
* CSV
* Excel
* HTML
* SQL

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./data/example")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df.to_csv('./data/my_output', index=False) # do not include index column

In [4]:
pd.read_csv('./data/my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_excel('./data/Excel_Sample.xlsx', sheet_name= 'Sheet1')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [6]:
df.to_excel('./data/newExcel_Sample.xlsx', sheet_name = 'NewSheet', index = False)
# overwrites to any file with the same name

In [7]:
# HTML input reading
# pd.read_html
# Read HTML tables into a ``list`` of ``DataFrame`` objects.

In [8]:
url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
data = pd.read_html(url)

In [9]:
type(data)

list

In [10]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

In [11]:
# reading data from SQL
# simple SQL engine temp held in memory
# search for driver for your specific case. ie. pyMySQL

In [12]:
from sqlalchemy import create_engine

In [13]:
engine = create_engine('sqlite:///:memory:')

In [14]:
df.to_sql('mytable', engine) # connect to sql engine

In [15]:
sqldf = pd.read_sql('mytable', engine)
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15

In [16]:
# Another SQL engine example for failed banks - using 

url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
data = pd.read_html(url)

from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

failedBanksdf = data[0] 

# create the sql table
failedBanksdf.to_sql('failedbanks', engine)

# sqlfailedBanksdf = pd.read_sql_table('failedbanks', engine) # old version
sqlfailedBanksdf = pd.read_sql('failedbanks', engine)
sqlfailedBanksdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 563 entries, 0 to 562
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   index                  563 non-null    int64
 1   Bank Name              563 non-null    object
 2   City                   563 non-null    object
 3   State                  563 non-null    object
 4   Cert                   563 non-null    int64
 5   Acquiring Institution  563 non-null    object
 6   Closing Date           563 non-null    object
dtypes: int64(2), object(5)
memory usage: 30.9+ KB

In [17]:
sqlqueryfailedBanksdf = pd.read_sql("SELECT * FROM failedbanks WHERE State=='NE'", engine)
sqlqueryfailedBanksdf

,index,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,128,"Mid City Bank, Inc.",Omaha,NE,19397,Premier Bank,"November 4, 2011"
2,290,TierOne Bank,Lincoln,NE,29341,Great Western Bank,"June 4, 2010"
3,501,Sherman County Bank,Loup City,NE,5431,Heritage Bank,"February 13, 2009"

# *** END OF CHAPTER ***